# Data Processing with Pandas

Changing working directory.

In [2]:
%cd D:\Data Science\GitHub\Python Learning\Python-for-Data-Science\Data Files\Python Learning

D:\Data Science\GitHub\Python Learning\Python-for-Data-Science\Data Files\Python Learning

## 1. The Series Data Structure
Series is the <u>one-dimensional</u> data structure in <i>pandas</i>.

In [3]:
import pandas as pd
import numpy as np

In [4]:
animals = ['Tiger', 'Bear', 'Moose']
pd.Series(animals)

0    Tiger
1     Bear
2    Moose
dtype: object

In [5]:
type(animals)

list

* <b>Handling Missing Values</b>

In [6]:
animals = ['Tiger', 'Bear', None]
pd.Series(animals)

0    Tiger
1     Bear
2     None
dtype: object

In [7]:
numbers = [1, 2, None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

Here pandas series will turn the missing value to be **NaN**, which is <font color = "red">different</font> from **None**.
<br>
To check if a value is **Nan**,

In [8]:
np.isnan(pd.Series(numbers)[2])

True

* <b>Creating Series from Dictionaries</b>

In [9]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

* <b>Creating Series with Separate Index Creation</b>

In [10]:
s = pd.Series(['Tiger', 'Bear', 'Moose'], index=['India', 'America', 'Canada'])
s

India      Tiger
America     Bear
Canada     Moose
dtype: object

If the number of indexes are not aligned with keys, <i>pandas</i> will assign <font color = "red">NaN</font> to those missing values.

In [11]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports, index=['Golf', 'Sumo', 'Hockey'])
s

Golf      Scotland
Sumo         Japan
Hockey         NaN
dtype: object

### 1.1 Querying a Series

In [12]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

* Using <b>iloc</b> and <b>loc</b> attribute to query series

In [13]:
s.iloc[3] #query by position

'South Korea'

In [14]:
s.loc['Golf'] #query by index

'Scotland'

<font color = "blue">Be careful when using the indexing operator on the series itself. And the safer option is to be more explicit and use the iloc or loc attributes directly. </font>

* <b>Appending New Values</b>

In [15]:
s = pd.Series([1, 2, 3])
s.loc['Animal'] = 'Bears'
s

0             1
1             2
2             3
Animal    Bears
dtype: object

* <b>Non-unique Index</b>

In [16]:
original_sports = pd.Series({'Archery': 'Bhutan',
                             'Golf': 'Scotland',
                             'Sumo': 'Japan',
                             'Taekwondo': 'South Korea'})
cricket_loving_countries = pd.Series(['Australia',
                                      'Barbados',
                                      'Pakistan',
                                      'England'], 
                                   index=['Cricket',
                                          'Cricket',
                                          'Cricket',
                                          'Cricket'])
all_countries = original_sports.append(cricket_loving_countries)

In [17]:
print(all_countries)
print(original_sports)

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object
Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

<font color = "blue"> **Note** that even though we applied <i>.append</i> method to <i>original_sports</i>, the original series was not changed.

## 2. DataFrame Data Structure
Series is the <u>two-dimensional</u> data structure in <i>pandas</i>.

### 2.1 Query from DataFrame

In [18]:
import pandas as pd

purchase_1 = pd.Series({'Name': 'Chris',
                       'Item Purchased': 'Dog Food',
                       'Cost': 22.50})

purchase_2 = pd.Series({'Name': 'Kevyn',
                       'Item Purchased': 'Kitty Litter',
                       'Cost': 2.50})

purchase_3 = pd.Series({'Name': 'Vinod',
                       'Item Purchased': 'Bird Seed',
                       'Cost': 5.00})

# Define the DataFrame here:
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index = ['Store 1', 'Store 2', 'Store 3'])
df.head()

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 2  Kevyn   Kitty Litter   2.5
Store 3  Vinod      Bird Seed   5.0

* Query element from DataFrame using <b>loc</b>.

In [19]:
df.loc['Store 3']

Name                  Vinod
Item Purchased    Bird Seed
Cost                      5
Name: Store 3, dtype: object

* Index can be <b>non-unique</b>

In [20]:
df2 = pd.DataFrame([purchase_1, purchase_2, purchase_3], index = ['Store 1', 'Store 1', 'Store 3'])
df2.loc['Store 1']

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5

* Selecting columns

In [21]:
df.loc[:, ['Name', 'Cost']]

          Name  Cost
Store 1  Chris  22.5
Store 2  Kevyn   2.5
Store 3  Vinod   5.0

* <b>NOTE:</b> Avoid Query by <font color = 'red'>Chaining Selecting</font>
<br>
This will creating a copy of dataset, which will be quit inefficient.

In [22]:
df.loc['Store 1']['Cost']

22.5

### 2.2 Dropping & Adding Data from DataFrame

* Dropping Rows

In [23]:
df.drop('Store 1')

          Name Item Purchased  Cost
Store 2  Kevyn   Kitty Litter   2.5
Store 3  Vinod      Bird Seed   5.0

<b>NOTE:</b> The original dataset is untouched.

In [24]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 2  Kevyn   Kitty Litter   2.5
Store 3  Vinod      Bird Seed   5.0

* Dropping Columns

In [25]:
copy_df = df.copy()
del copy_df['Name']
copy_df

        Item Purchased  Cost
Store 1       Dog Food  22.5
Store 2   Kitty Litter   2.5
Store 3      Bird Seed   5.0

* Adding Columns

In [26]:
df['Location'] = None
df

          Name Item Purchased  Cost Location
Store 1  Chris       Dog Food  22.5     None
Store 2  Kevyn   Kitty Litter   2.5     None
Store 3  Vinod      Bird Seed   5.0     None

## 3. DataFrame Indexing and Loading

<b>NOTE:</b> <font color = 'red'>If you want to explicitly use a <b>copy</b>, then you should consider calling the <b>copy method</b> on the DataFrame for it first.</font>

### 3.1 Creating DataFrame from .csv files.

In [27]:
%cd D:\Data Science\GitHub\Python Learning\Python-for-Data-Science\Data Files\Python Learning

df = pd.read_csv('expense_report.csv', skiprows = 0)    
df.head()

D:\Data Science\GitHub\Python Learning\Python-for-Data-Science\Data Files\Python Learning

,TRXN_MONTH,TRXN_DT,TRXN_AMT,MERCHT_NAME,CATG
0,Mar-19,01/03/2019,61.20,VIRGIN ACTIVE,Entertainment
1,Mar-19,04/03/2019,1.31,LOON FUNG LIMITED,Glossary
2,Mar-19,04/03/2019,16.89,LOON FUNG LIMITED,Glossary
3,Mar-19,04/03/2019,20.00,LNK CAPITAL ONE,Other
4,Mar-19,05/03/2019,2.85,SAINSBURY'S SPRMRKTS LT NOTTINGHAM,Glossary

* Show Names of All Columns in the DataFrame.

In [28]:
df.columns

Index(['TRXN_MONTH', 'TRXN_DT', 'TRXN_AMT', 'MERCHT_NAME', 'CATG'], dtype='object')

## 4. Querying a DataFrame

### 4.1 Querying DataFrame by Boolean Masking

* <b>Step 1.</b> creating Boolean masking array.

In [29]:
df['TRXN_AMT'] > 5

0        True
1       False
2        True
3        True
4       False
5        True
6        True
7        True
8        True
9        True
10       True
11      False
12       True
13       True
14       True
15       True
16       True
17       True
18       True
19       True
20       True
21      False
22       True
23       True
24      False
25       True
26       True
27      False
28      False
29      False
        ...
1177     True
1178    False
1179    False
1180    False
1181     True
1182    False
1183    False
1184    False
1185     True
1186    False
1187     True
1188    False
1189     True
1190     True
1191     True
1192     True
1193     True
1194     True
1195     True
1196     True
1197     True
1198     True
1199     True
1200     True
1201     True
1202     True
1203     True
1204     True
1205     True
1206     True
Name: TRXN_AMT, Length: 1207, dtype: bool

* <b>Step 2.</b> overlay the masking on the DataFrame by <b>where</b> function.

In [30]:
df_500 = df.where(df['TRXN_AMT'] > 5)
df_500.head()

  TRXN_MONTH     TRXN_DT  TRXN_AMT        MERCHT_NAME           CATG
0     Mar-19  01/03/2019     61.20      VIRGIN ACTIVE  Entertainment
1        NaN         NaN       NaN                NaN            NaN
2     Mar-19  04/03/2019     16.89  LOON FUNG LIMITED       Glossary
3     Mar-19  04/03/2019     20.00    LNK CAPITAL ONE          Other
4        NaN         NaN       NaN                NaN            NaN

<b>NOTE:</b> rows that do not match the condition will give <font color = 'red'>NaN</font> values.
<br>
To drop those <b>NaN</b> rows.

In [31]:
df_500 = df_500.dropna()
df_500.head()

,TRXN_MONTH,TRXN_DT,TRXN_AMT,MERCHT_NAME,CATG
0,Mar-19,01/03/2019,61.20,VIRGIN ACTIVE,Entertainment
2,Mar-19,04/03/2019,16.89,LOON FUNG LIMITED,Glossary
3,Mar-19,04/03/2019,20.00,LNK CAPITAL ONE,Other
5,Mar-19,06/03/2019,6.49,TESCO STORE 5660 5660TE WELWYN GARDEN C,Glossary
6,Mar-19,07/03/2019,35.40,SHANGHAI SHANGHAI SHANG NOTTINGHAM,Eating Out

* <b>However</b>, there is a quicker way to do that.

In [32]:
df_500 = df[df['TRXN_AMT'] > 5]
df_500.head()

,TRXN_MONTH,TRXN_DT,TRXN_AMT,MERCHT_NAME,CATG
0,Mar-19,01/03/2019,61.20,VIRGIN ACTIVE,Entertainment
2,Mar-19,04/03/2019,16.89,LOON FUNG LIMITED,Glossary
3,Mar-19,04/03/2019,20.00,LNK CAPITAL ONE,Other
5,Mar-19,06/03/2019,6.49,TESCO STORE 5660 5660TE WELWYN GARDEN C,Glossary
6,Mar-19,07/03/2019,35.40,SHANGHAI SHANGHAI SHANG NOTTINGHAM,Eating Out

## 5. Indexing DataFrame

### 5.1 Setting Index of DataFrame

* Re-indexing DataFrame

In [39]:
df = df.set_index('CATG')
df.head()

,level_0,index,TRXN_MONTH,TRXN_DT,TRXN_AMT,MERCHT_NAME
CATG,,,,,,
Entertainment,0,0,Mar-19,01/03/2019,61.20,VIRGIN ACTIVE
Glossary,1,1,Mar-19,04/03/2019,1.31,LOON FUNG LIMITED
Glossary,2,2,Mar-19,04/03/2019,16.89,LOON FUNG LIMITED
Other,3,3,Mar-19,04/03/2019,20.00,LNK CAPITAL ONE
Glossary,4,4,Mar-19,05/03/2019,2.85,SAINSBURY'S SPRMRKTS LT NOTTINGHAM

* Reset Index by Number Series

In [40]:
df = df.reset_index()
df.head()

,CATG,level_0,index,TRXN_MONTH,TRXN_DT,TRXN_AMT,MERCHT_NAME
0,Entertainment,0,0,Mar-19,01/03/2019,61.20,VIRGIN ACTIVE
1,Glossary,1,1,Mar-19,04/03/2019,1.31,LOON FUNG LIMITED
2,Glossary,2,2,Mar-19,04/03/2019,16.89,LOON FUNG LIMITED
3,Other,3,3,Mar-19,04/03/2019,20.00,LNK CAPITAL ONE
4,Glossary,4,4,Mar-19,05/03/2019,2.85,SAINSBURY'S SPRMRKTS LT NOTTINGHAM

### 5.2 Multi-level Index in DataFrame

* Changing the DataFrame to be Multi-level Indexed

In [105]:
df['TRXN_MONTH'].unique()
df = df[df['TRXN_MONTH'] == 'Oct-19']
df.head()

,CATG,TRXN_MONTH,TRXN_DT,TRXN_AMT,MERCHT_NAME
807,Transport,Oct-19,01/10/2019,5.30,TFL TRAVEL CHARGE TFL.GOV.UK/CP
808,Transport,Oct-19,01/10/2019,2.90,TFL TRAVEL CHARGE TFL.GOV.UK/CP
809,Glossary,Oct-19,01/10/2019,2.50,WAITROSE CONVENIENCE NOTTINGHAM
810,Eating Out,Oct-19,01/10/2019,6.55,STARBUCKS TESCO LONDON
811,Transport,Oct-19,01/10/2019,5.70,TFL TRAVEL CHARGE TFL.GOV.UK/CP

In [106]:
df = df.set_index(['TRXN_DT', 'CATG'])
df.head()

                      TRXN_MONTH  TRXN_AMT                      MERCHT_NAME
TRXN_DT    CATG
01/10/2019 Transport      Oct-19      5.30  TFL TRAVEL CHARGE TFL.GOV.UK/CP
           Transport      Oct-19      2.90  TFL TRAVEL CHARGE TFL.GOV.UK/CP
           Glossary       Oct-19      2.50  WAITROSE CONVENIENCE NOTTINGHAM
           Eating Out     Oct-19      6.55           STARBUCKS TESCO LONDON
           Transport      Oct-19      5.70  TFL TRAVEL CHARGE TFL.GOV.UK/CP

* Querying the data

In [107]:
df.loc[[('01/10/2019', 'Transport'), ('02/10/2019', 'Glossary')]]

                     TRXN_MONTH  TRXN_AMT                      MERCHT_NAME
TRXN_DT    CATG
01/10/2019 Transport     Oct-19      5.30  TFL TRAVEL CHARGE TFL.GOV.UK/CP
           Transport     Oct-19      2.90  TFL TRAVEL CHARGE TFL.GOV.UK/CP
           Transport     Oct-19      5.70  TFL TRAVEL CHARGE TFL.GOV.UK/CP
           Transport     Oct-19      4.40  TFL TRAVEL CHARGE TFL.GOV.UK/CP
           Transport     Oct-19      5.30  TFL TRAVEL CHARGE TFL.GOV.UK/CP
           Transport     Oct-19      5.80  TFL TRAVEL CHARGE TFL.GOV.UK/CP
           Transport     Oct-19      5.70  TFL TRAVEL CHARGE TFL.GOV.UK/CP
02/10/2019 Glossary      Oct-19      3.91                      CAPITAL ONE

## 6. Missing Values

In [111]:
df.fillna
df.head()

                      TRXN_MONTH  TRXN_AMT                      MERCHT_NAME
TRXN_DT    CATG
01/10/2019 Transport      Oct-19      5.30  TFL TRAVEL CHARGE TFL.GOV.UK/CP
           Transport      Oct-19      2.90  TFL TRAVEL CHARGE TFL.GOV.UK/CP
           Glossary       Oct-19      2.50  WAITROSE CONVENIENCE NOTTINGHAM
           Eating Out     Oct-19      6.55           STARBUCKS TESCO LONDON
           Transport      Oct-19      5.70  TFL TRAVEL CHARGE TFL.GOV.UK/CP